app/Filters/AuthFilter.php

SELECT *
FROM `users`
WHERE `users`.`id` = 1
---
    public function before(RequestInterface $request, $arguments = null)
    {
        $staffId = session()->get('staff_id');

        if ($staffId === null || (new UserModel())->find($staffId) === null) {