app/Controllers/Login.php

SELECT *
FROM `users`
WHERE `username` = 'admin'
 LIMIT 1
---
    public function submit()
    {
        $username = $this->request->getPost('username');
        $password = $this->request->getPost('password');

        $user = (new UserModel())->where('username', $username)->first();