app/Controllers/Products.php

    public function index()
    {
        $productModel = new ProductModel();

        $data['products'] = $productModel
            ->orderBy('id', 'ASC')
            ->findAll();
---
SELECT *
FROM `products`
ORDER BY `id` ASC